_software/linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-27 Sat 15:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learn Linux because -i sed so</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="2019 Software Team" />
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />


</head>
<body>
<div id="content">
<h1 class="title">Learn Linux because -i sed so</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge13725f">1. Installation</a></li>
<li><a href="#org9d9d877">2. Usage</a>
<ul>
<li><a href="#org8926bf0">2.1. Bash</a>
<ul>
<li><a href="#orgff9f465">2.1.1. Basic Commands</a>
<ul>
<li><a href="#org57308a8">2.1.1.1. Navigate file structure</a>
<ul>
<li><a href="#org0016cc7">2.1.1.1.1. ls  (list files in directory)</a></li>
<li><a href="#org2e3f363">2.1.1.1.2. cd  (change directory)</a></li>
<li><a href="#orgf686f26">2.1.1.1.3. clear (clear terminal display)</a></li>
<li><a href="#orgb28a61f">2.1.1.1.4. find (find stuff)</a></li>
</ul>
</li>
<li><a href="#org242dbfb">2.1.1.2. Mutate file structure</a>
<ul>
<li><a href="#org4acfd8d">2.1.1.2.1. mv  (move file)</a></li>
<li><a href="#orgce0fc31">2.1.1.2.2. cp  (copy)</a></li>
<li><a href="#org1956801">2.1.1.2.3. rm  (remove)</a></li>
<li><a href="#org899598a">2.1.1.2.4. ln  (link)</a></li>
</ul>
</li>
<li><a href="#org87f6eb2">2.1.1.3. bash vars</a>
<ul>
<li><a href="#org674f66c">2.1.1.3.1. export (export a variable to the environment ( used for PATH a lot))</a></li>
<li><a href="#orgf5ee6ac">2.1.1.3.2. alias (create an alias for a bash expression)</a></li>
</ul>
</li>
<li><a href="#org9fdc954">2.1.1.4. text utilities</a>
<ul>
<li><a href="#org0435879">2.1.1.4.1. grep (regex search through text)</a></li>
<li><a href="#org562f036">2.1.1.4.2. wc ( word line char count)</a></li>
</ul>
</li>
<li><a href="#orgacbbbf3">2.1.1.5. Network management</a>
<ul>
<li><a href="#orgd9d6a35">2.1.1.5.1. ip (networking information, and configuration)</a></li>
</ul>
</li>
<li><a href="#orgb7271a0">2.1.1.6. permissions management</a>
<ul>
<li><a href="#org6a938f4">2.1.1.6.1. su (switch user (default is root))</a></li>
<li><a href="#org090a9f1">2.1.1.6.2. sudo (execute command with root privileges)</a></li>
<li><a href="#org75cbc80">2.1.1.6.3. adduser ( user profile management (create users, add them to groups, etc)</a></li>
<li><a href="#org5301350">2.1.1.6.4. chmod  (modify file ownership)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgde4c4fd">2.1.2. Pipes, i.e. Linux-DuctTape , and more bash syntax</a></li>
<li><a href="#orgea89b4e">2.1.3. WildCards / Patterns</a></li>
<li><a href="#orgcadde3b">2.1.4. Path variables</a></li>
<li><a href="#orgc176eb8">2.1.5. Configuration Files</a></li>
<li><a href="#org77031eb">2.1.6. Scripts</a></li>
</ul>
</li>
<li><a href="#orgeb51e96">2.2. File Structure</a>
<ul>
<li><a href="#orgaee152f">2.2.1. /</a></li>
<li><a href="#orgc54d34c">2.2.2. /dev</a></li>
<li><a href="#orgba81cb9">2.2.3. /etc</a></li>
<li><a href="#org75f9a72">2.2.4. /opt</a></li>
<li><a href="#org92327df">2.2.5. /usr</a>
<ul>
<li><a href="#org558a2bb">2.2.5.1. /bin</a></li>
<li><a href="#org42b65f8">2.2.5.2. /lib</a></li>
<li><a href="#org9ee01b8">2.2.5.3. /include</a></li>
</ul>
</li>
<li><a href="#org3d5a4e7">2.2.6. /usr/local</a>
<ul>
<li><a href="#org4d9e638">2.2.6.1. tldr /bin /lib /include</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org834c6d3">2.3. Users , Permissions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge13725f" class="outline-2">
<h2 id="orge13725f"><span class="section-number-2">1</span> Installation</h2>
</div>
<div id="outline-container-org9d9d877" class="outline-2">
<h2 id="org9d9d877"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8926bf0" class="outline-3">
<h3 id="org8926bf0"><span class="section-number-3">2.1</span> Bash</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgff9f465" class="outline-4">
<h4 id="orgff9f465"><span class="section-number-4">2.1.1</span> Basic Commands</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<div id="outline-container-org57308a8" class="outline-5">
<h5 id="org57308a8"><span class="section-number-5">2.1.1.1</span> Navigate file structure</h5>
<div class="outline-text-5" id="text-2-1-1-1">
</div>
<div id="outline-container-org0016cc7" class="outline-6">
<h6 id="org0016cc7"><span class="section-number-6">2.1.1.1.1</span> ls  (list files in directory)</h6>
<div class="outline-text-6" id="text-2-1-1-1-1">
<div class="org-src-container">
<pre class="src src-shell">ls 
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e3f363" class="outline-6">
<h6 id="org2e3f363"><span class="section-number-6">2.1.1.1.2</span> cd  (change directory)</h6>
</div>
<div id="outline-container-orgf686f26" class="outline-6">
<h6 id="orgf686f26"><span class="section-number-6">2.1.1.1.3</span> clear (clear terminal display)</h6>
</div>
<div id="outline-container-orgb28a61f" class="outline-6">
<h6 id="orgb28a61f"><span class="section-number-6">2.1.1.1.4</span> find (find stuff)</h6>
</div>
</div>
<div id="outline-container-org242dbfb" class="outline-5">
<h5 id="org242dbfb"><span class="section-number-5">2.1.1.2</span> Mutate file structure</h5>
<div class="outline-text-5" id="text-2-1-1-2">
</div>
<div id="outline-container-org4acfd8d" class="outline-6">
<h6 id="org4acfd8d"><span class="section-number-6">2.1.1.2.1</span> mv  (move file)</h6>
</div>
<div id="outline-container-orgce0fc31" class="outline-6">
<h6 id="orgce0fc31"><span class="section-number-6">2.1.1.2.2</span> cp  (copy)</h6>
</div>
<div id="outline-container-org1956801" class="outline-6">
<h6 id="org1956801"><span class="section-number-6">2.1.1.2.3</span> rm  (remove)</h6>
</div>
<div id="outline-container-org899598a" class="outline-6">
<h6 id="org899598a"><span class="section-number-6">2.1.1.2.4</span> ln  (link)</h6>
</div>
</div>
<div id="outline-container-org87f6eb2" class="outline-5">
<h5 id="org87f6eb2"><span class="section-number-5">2.1.1.3</span> bash vars</h5>
<div class="outline-text-5" id="text-2-1-1-3">
</div>
<div id="outline-container-org674f66c" class="outline-6">
<h6 id="org674f66c"><span class="section-number-6">2.1.1.3.1</span> export (export a variable to the environment ( used for PATH a lot))</h6>
</div>
<div id="outline-container-orgf5ee6ac" class="outline-6">
<h6 id="orgf5ee6ac"><span class="section-number-6">2.1.1.3.2</span> alias (create an alias for a bash expression)</h6>
</div>
</div>
<div id="outline-container-org9fdc954" class="outline-5">
<h5 id="org9fdc954"><span class="section-number-5">2.1.1.4</span> text utilities</h5>
<div class="outline-text-5" id="text-2-1-1-4">
</div>
<div id="outline-container-org0435879" class="outline-6">
<h6 id="org0435879"><span class="section-number-6">2.1.1.4.1</span> grep (regex search through text)</h6>
</div>
<div id="outline-container-org562f036" class="outline-6">
<h6 id="org562f036"><span class="section-number-6">2.1.1.4.2</span> wc ( word line char count)</h6>
</div>
</div>

<div id="outline-container-orgacbbbf3" class="outline-5">
<h5 id="orgacbbbf3"><span class="section-number-5">2.1.1.5</span> Network management</h5>
<div class="outline-text-5" id="text-2-1-1-5">
</div>
<div id="outline-container-orgd9d6a35" class="outline-6">
<h6 id="orgd9d6a35"><span class="section-number-6">2.1.1.5.1</span> ip (networking information, and configuration)</h6>
</div>
</div>
<div id="outline-container-orgb7271a0" class="outline-5">
<h5 id="orgb7271a0"><span class="section-number-5">2.1.1.6</span> permissions management</h5>
<div class="outline-text-5" id="text-2-1-1-6">
</div>
<div id="outline-container-org6a938f4" class="outline-6">
<h6 id="org6a938f4"><span class="section-number-6">2.1.1.6.1</span> su (switch user (default is root))</h6>
</div>
<div id="outline-container-org090a9f1" class="outline-6">
<h6 id="org090a9f1"><span class="section-number-6">2.1.1.6.2</span> sudo (execute command with root privileges)</h6>
</div>
<div id="outline-container-org75cbc80" class="outline-6">
<h6 id="org75cbc80"><span class="section-number-6">2.1.1.6.3</span> adduser ( user profile management (create users, add them to groups, etc)</h6>
</div>
<div id="outline-container-org5301350" class="outline-6">
<h6 id="org5301350"><span class="section-number-6">2.1.1.6.4</span> chmod  (modify file ownership)</h6>
</div>
</div>
</div>

<div id="outline-container-orgde4c4fd" class="outline-4">
<h4 id="orgde4c4fd"><span class="section-number-4">2.1.2</span> Pipes, i.e. Linux-DuctTape , and more bash syntax</h4>
</div>
<div id="outline-container-orgea89b4e" class="outline-4">
<h4 id="orgea89b4e"><span class="section-number-4">2.1.3</span> WildCards / Patterns</h4>
</div>
<div id="outline-container-orgcadde3b" class="outline-4">
<h4 id="orgcadde3b"><span class="section-number-4">2.1.4</span> Path variables</h4>
</div>
<div id="outline-container-orgc176eb8" class="outline-4">
<h4 id="orgc176eb8"><span class="section-number-4">2.1.5</span> Configuration Files</h4>
</div>
<div id="outline-container-org77031eb" class="outline-4">
<h4 id="org77031eb"><span class="section-number-4">2.1.6</span> Scripts</h4>
</div>
</div>
<div id="outline-container-orgeb51e96" class="outline-3">
<h3 id="orgeb51e96"><span class="section-number-3">2.2</span> File Structure</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A grand tour of who's who in the linux file system 
</p>
</div>
<div id="outline-container-orgaee152f" class="outline-4">
<h4 id="orgaee152f"><span class="section-number-4">2.2.1</span> /</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Contains everything , don't do 
</p>
<div class="org-src-container">
<pre class="src src-shell">rm -rf /
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc54d34c" class="outline-4">
<h4 id="orgc54d34c"><span class="section-number-4">2.2.2</span> /dev</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Contains device and io files, your usb devices, serial connections, spi connections communicate with linux through these. Might need to play around with permissions here on occasion
the vaunted stdout/stdin files live here
</p>
</div>
</div>
<div id="outline-container-orgba81cb9" class="outline-4">
<h4 id="orgba81cb9"><span class="section-number-4">2.2.3</span> /etc</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Contains system configuration files 
  the hosts(ip masks and stuff) sudoers(who has what administrative privaleges) files are here along with lots of others, such as many systemwide systemD scripts
</p>
</div>
</div>
<div id="outline-container-org75f9a72" class="outline-4">
<h4 id="org75f9a72"><span class="section-number-4">2.2.4</span> /opt</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Ros lives here once installed. opt is kind of like an appendix. most user software is installed in /usr/local{/share}
</p>
</div>
</div>
<div id="outline-container-org92327df" class="outline-4">
<h4 id="org92327df"><span class="section-number-4">2.2.5</span> /usr</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
most system software , your linux utilities, c++ stl headers, etc live here
</p>
</div>
<div id="outline-container-org558a2bb" class="outline-5">
<h5 id="org558a2bb"><span class="section-number-5">2.2.5.1</span> /bin</h5>
<div class="outline-text-5" id="text-2-2-5-1">
<p>
where the executables live
</p>
</div>
</div>
<div id="outline-container-org42b65f8" class="outline-5">
<h5 id="org42b65f8"><span class="section-number-5">2.2.5.2</span> /lib</h5>
<div class="outline-text-5" id="text-2-2-5-2">
<p>
where the linkables live
</p>
</div>
</div>
<div id="outline-container-org9ee01b8" class="outline-5">
<h5 id="org9ee01b8"><span class="section-number-5">2.2.5.3</span> /include</h5>
<div class="outline-text-5" id="text-2-2-5-3">
<p>
where the headers lives 
</p>
</div>
</div>
</div>

<div id="outline-container-org3d5a4e7" class="outline-4">
<h4 id="org3d5a4e7"><span class="section-number-4">2.2.6</span> /usr/local</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
Where globally available user-level software lives ( in theory ) 
</p>
</div>
<div id="outline-container-org4d9e638" class="outline-5">
<h5 id="org4d9e638"><span class="section-number-5">2.2.6.1</span> tldr /bin /lib /include</h5>
</div>
</div>
</div>

<div id="outline-container-org834c6d3" class="outline-3">
<h3 id="org834c6d3"><span class="section-number-3">2.3</span> Users , Permissions</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 2019 Software Team</p>
<p class="date">Created: 2019-04-27 Sat 15:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
